; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v2)
             (pred_7 ?v5 ?v12)
             (pred_3 ?v8 ?v12)
             (pred_4 ?v11 ?v8 )
	     (pred_2 ?v8)
             (pred_9 ?v4)
             (pred_1 ?v5)
             (pred_11 ?v12)
             (pred_12 ?v8)
             (pred_6 ?v5)
             (pred_8 ?v8)
             (pred_5 ))



(:action op_1
:parameters (?v10 ?v7 ?v9 ?v13)
:precondition (and (pred_9 ?v10) (pred_9 ?v7) (pred_1 ?v9) (pred_11 ?v13)
          (pred_10 ?v10 ?v7) (pred_7 ?v9 ?v13)
                   (pred_3 ?v7 ?v13) (pred_2 ?v10) 
                   (pred_12 ?v7) (pred_6 ?v9))
:effect (and  (pred_8 ?v7) (not (pred_12 ?v7))))


(:action op_3
:parameters (?v10 ?v6)
:precondition (and (pred_9 ?v10) (pred_9 ?v6)
               (pred_2 ?v10) (pred_10 ?v10 ?v6) (pred_8 ?v6))
:effect (and (pred_2 ?v6) (not (pred_2 ?v10))))

(:action op_2
:parameters (?v10 ?v9)
:precondition (and (pred_9 ?v10) (pred_1 ?v9) 
                  (pred_2 ?v10) (pred_4 ?v9 ?v10) (pred_5 ))
:effect (and (pred_6 ?v9)
   (not (pred_4 ?v9 ?v10)) (not (pred_5 ))))


(:action op_4
:parameters (?v10 ?v3 ?v1)
:precondition (and (pred_9 ?v10) (pred_1 ?v3) (pred_1 ?v1)
                  (pred_2 ?v10) (pred_6 ?v1) (pred_4 ?v3 ?v10))
:effect (and (pred_6 ?v3) (pred_4 ?v1 ?v10)
        (not (pred_6 ?v1)) (not (pred_4 ?v3 ?v10))))

(:action op_5
:parameters (?v10 ?v9)
:precondition (and (pred_9 ?v10) (pred_1 ?v9) 
                  (pred_2 ?v10) (pred_6 ?v9))
:effect (and (pred_5 ) (pred_4 ?v9 ?v10) (not (pred_6 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_11 obj_02 obj_08 obj_12 obj_06 obj_05 obj_10 obj_20 obj_13 obj_09 obj_01 obj_17 obj_18 obj_03 obj_14
    obj_16 obj_15
    obj_07 obj_04
    )

    (:init
       (pred_5)

       (pred_9 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_06)
       (pred_9 obj_05)
       (pred_9 obj_10)
       (pred_9 obj_20)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_18)
       (pred_9 obj_03)
       (pred_9 obj_14)
       (pred_11 obj_16)
       (pred_11 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_04)

       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_09)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_14 obj_03)
       (pred_12 obj_20)
       (pred_12 obj_06)
       (pred_3  obj_20 obj_16)
       (pred_3  obj_06 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_17)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_14)

       (pred_7  obj_07 obj_16)
       (pred_7  obj_04 obj_15)
       (pred_4 obj_07 obj_17)
       (pred_4 obj_04 obj_01)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_4 obj_04 obj_10)
    ))
(:constraints
  (always (not (pred_2 obj_09)))
)
)

; plan
1. (op_3 obj_17 obj_18)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_03)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_03)
   goals met: 0 of 1
3. (op_3 obj_03 obj_14)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_14)
   goals met: 0 of 1
4. (op_3 obj_14 obj_01)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_04)
   deleted: (pred_4 obj_04 obj_01) (pred_5)
   added: (pred_6 obj_04)
   goals met: 0 of 1
6. (op_3 obj_01 obj_10)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_10)
   goals met: 0 of 1
7. (op_5 obj_10 obj_04)
   deleted: (pred_6 obj_04)
   added: (pred_5) (pred_4 obj_04 obj_10)
   goals met: 1 of 1
